jelson/rulos/src/lib/chip/arm/stm32/periph/uart/uart.c
/*
 * Copyright (C) 2009 Jon Howell (jonh@jonh.net) and Jeremy Elson
 * (jelson@gmail.com).
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <https://www.gnu.org/licenses/>.
 */

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "core/hal.h"
#include "core/hardware.h"
#include "core/logging.h"
#include "periph/uart/uart_hal.h"
#include "stm32.h"

#include "core/dma.h"

/*
 * USE_RX_DMA_FOR_CHIP: chip has enough DMA channels to use DMA for RX
 *                      (vs. per-char RXNE interrupt).
 * USE_RULOS_DMA_FOR_UART: the new RULOS DMA abstraction owns this chip's
 *                         UART DMA channels (both TX and RX). Families
 *                         that haven't been migrated to the new API yet
 *                         keep the old hand-rolled HAL/LL DMA paths.
 *
 * G4 was migrated in the Phase 1 commit of the DMA refactor. G0 and the
 * F-family migrations land in later phases.
 */
#if defined(RULOS_ARM_stm32g0) || defined(RULOS_ARM_stm32g4)
#define USE_RX_DMA_FOR_CHIP 1
#else
#define USE_RX_DMA_FOR_CHIP 0
#endif

#if defined(RULOS_ARM_stm32g4)
#define USE_RULOS_DMA_FOR_UART 1
#else
#define USE_RULOS_DMA_FOR_UART 0
#endif

//////////////////////////////////////////////////////////////////////////////

typedef struct {
  // housekeeping
  bool initted;
  bool rx_gpio_initted;
  bool tx_gpio_initted;

  // RULOS HAL API: the upcall to get more data and the user data for that
  // callback
  uint8_t uart_id;
  void *user_data;

  // tx
  hal_uart_next_sendbuf_cb next_sendbuf_cb;

  // rx
  hal_uart_receive_cb rx_cb;
  char *rx_buf;
  // buflen we're given by the layer above, divided by two: size of each half
  size_t rx_half_buflen;
  bool rx_cb_ready;    // has the previous call to rx_cb completed?
  bool rx_data_ready;  // have we received an idle interrupt?

  // rx--interrupt mode only
  char *rx_curr_base_buf;  // points to rx_buf, or halfway into rx_buf
  size_t rx_bytes_stored;  // number of bytes received

#if USE_RULOS_DMA_FOR_UART
  // RULOS DMA abstraction channel handles (allocated in hal_uart_init).
  // Drives both TX and RX DMA. Replaces the HAL UART handle and HAL DMA
  // handle on migrated families.
  rulos_dma_channel_t *tx_dma_ch;
  rulos_dma_channel_t *rx_dma_ch;
  // Base address of the peripheral's TX data register. Cached so the
  // tc_callback can re-arm the next transfer from ISR context.
  volatile void *usart_tdr;
#else
  // UART handle from STM32's HAL (legacy, for families not yet migrated
  // to the RULOS DMA abstraction)
  UART_HandleTypeDef hal_uart_handle;

  // Transmit and receive DMA buffers and DMA handles (legacy)
  DMA_HandleTypeDef hal_dma_tx_handle;
#endif

  // statistics
  uint32_t tot_ints;
  uint32_t tot_rx_bytes;
  uint32_t tot_tx_bytes;
  uint32_t dropped_rx_bytes;
  uint32_t frame_errors;
  uint32_t parity_errors;
  uint32_t noise_errors;
  uint32_t overruns;
  uint32_t idle_ints;
  uint16_t min_chars_per_rx_isr;
  uint16_t max_chars_per_rx_isr;
  uint16_t max_chars_per_tx_batch;
  uint16_t max_chars_per_rx_batch;
} stm32_uart_t;

/// Configuration

typedef struct {
  // general
  USART_TypeDef *instance;
  IRQn_Type instance_irqn;

  // rx
  gpio_pin_t rx_pin;
  uint32_t rx_altfunc;
#if !USE_RULOS_DMA_FOR_UART
  DMA_TypeDef *rx_dma_instance;
  int rx_dma_channel;
  IRQn_Type rx_dma_irqn;
  uint32_t rx_dma_request;
#endif

  // tx
  gpio_pin_t tx_pin;
  uint32_t tx_altfunc;
#if !USE_RULOS_DMA_FOR_UART
  DMA_Channel_TypeDef *tx_dma_chan;
  IRQn_Type tx_dma_irqn;
  uint32_t tx_dma_request;
#endif

#if USE_RULOS_DMA_FOR_UART
  // Logical DMA request identifiers; the RULOS DMA core translates
  // these to hardware channel assignments at init time.
  rulos_dma_request_t rx_dma_req;
  rulos_dma_request_t tx_dma_req;
#endif
} stm32_uart_config_t;

static void on_usart_interrupt(uint8_t uart_id);
static void config_gpio(const stm32_uart_config_t *config, bool rx);

#if !USE_RULOS_DMA_FOR_UART
static void dispatch_tx_dma(uint8_t uart_id);
#if USE_RX_DMA_FOR_CHIP
static void on_rx_dma_interrupt(uint8_t uart_id);
#endif
#endif

///// pin selections

// rulos uart 0
#ifndef RULOS_UART0_RX_PIN
#define RULOS_UART0_RX_PIN GPIO_A10
#endif

#ifndef RULOS_UART0_TX_PIN
#define RULOS_UART0_TX_PIN GPIO_A9
#endif

// rulos uart 1
#ifndef RULOS_UART1_RX_PIN
#define RULOS_UART1_RX_PIN GPIO_A3
#endif

#ifndef RULOS_UART1_TX_PIN
#define RULOS_UART1_TX_PIN GPIO_A2
#endif

// rulos uart 2
#ifndef RULOS_UART2_RX_PIN
#define RULOS_UART2_RX_PIN GPIO_B9
#endif

#ifndef RULOS_UART2_TX_PIN
#define RULOS_UART2_TX_PIN GPIO_B2
#endif

// rulos uart 3
#ifndef RULOS_UART3_RX_PIN
#define RULOS_UART3_RX_PIN GPIO_A1
#endif

#ifndef RULOS_UART3_TX_PIN
#define RULOS_UART3_TX_PIN GPIO_A0
#endif

// rulos uart 4
#ifndef RULOS_UART4_RX_PIN
#define RULOS_UART4_RX_PIN GPIO_B1
#endif

#ifndef RULOS_UART4_TX_PIN
#define RULOS_UART4_TX_PIN GPIO_B0
#endif

// rulos uart 5
#ifndef RULOS_UART5_RX_PIN
#define RULOS_UART5_RX_PIN GPIO_A5
#endif

#ifndef RULOS_UART5_TX_PIN
#define RULOS_UART5_TX_PIN GPIO_A4
#endif



///////////// stm32f0

#if defined(RULOS_ARM_stm32f0)

#include "stm32f0xx_ll_usart.h"
static const stm32_uart_config_t stm32_uart_config[] = {
    {
        .instance = USART1,
        .instance_irqn = USART1_IRQn,

        .rx_pin = RULOS_UART0_RX_PIN,
        .rx_altfunc = GPIO_AF1_USART1,

        .tx_pin = RULOS_UART0_TX_PIN,
        .tx_altfunc = GPIO_AF1_USART1,
        .tx_dma_chan = DMA1_Channel2,
        .tx_dma_irqn = DMA1_Channel2_3_IRQn,
    },
};

