jelson/rulos/src/lib/chip/arm/stm32/periph/uart/uart.c
void USART1_IRQHandler() {
  on_usart_interrupt(0);
}

void DMA1_Channel2_3_IRQHandler() {
  dispatch_tx_dma(0);
}

///////////// stm32f1

#elif defined(RULOS_ARM_stm32f1)

#include "stm32f1xx_ll_usart.h"
static const stm32_uart_config_t stm32_uart_config[] = {
    {
        .instance = USART1,
        .instance_irqn = USART1_IRQn,
        .rx_pin = RULOS_UART0_RX_PIN,
        .tx_pin = RULOS_UART0_TX_PIN,
        .tx_dma_chan = DMA1_Channel4,
        .tx_dma_irqn = DMA1_Channel4_IRQn,
    },
};

void USART1_IRQHandler() {
  on_usart_interrupt(0);
}

void DMA1_Channel4_IRQHandler() {
  dispatch_tx_dma(0);
}

///////////// stm32f3

#elif defined(RULOS_ARM_stm32f3)

void USART1_IRQHandler() {
  on_usart_interrupt(0);
}

void DMA1_Channel4_IRQHandler() {
  dispatch_tx_dma(0);
}

#include "stm32f3xx_ll_usart.h"
static const stm32_uart_config_t stm32_uart_config[] = {
    {
        .instance = USART1,
        .instance_irqn = USART1_IRQn,

        .rx_pin = RULOS_UART0_RX_PIN,
        .rx_altfunc = GPIO_AF7_USART1,

        .tx_pin = RULOS_UART0_TX_PIN,
        .tx_altfunc = GPIO_AF7_USART1,
        .tx_dma_chan = DMA1_Channel4,
        .tx_dma_irqn = DMA1_Channel4_IRQn,
    },
};

///////////// stm32g0

#elif defined(RULOS_ARM_stm32g0)

// Summary of stm32g0 uart DMA channels
//
// unit:channel

// (rulos_id) stm32_id  dma_rx  dma_tx
//      (0)      1        1:1     1:5
//      (1)      2        1:4     1:2(*)
//      (2)      3        2:1     1:3(*)
//      (3)      4        2:2     1:6
//      (4)      5        2:3     1:7
//      (5)      6        2:4     2:5
//
// (*) might get surrendered if sd card in use,
//     until dynamic dma allocation is implemented

void USART1_IRQHandler() {
  on_usart_interrupt(0);
}

void DMA1_Channel1_IRQHandler() {
  on_rx_dma_interrupt(0);  // DMA 1:1
}

#ifndef UART_SURRENDER_DMA1_CHAN2_3

void DMA1_Channel2_3_IRQHandler() {
  dispatch_tx_dma(1);  // DMA 1:2
#if STM32G0B1xx
  dispatch_tx_dma(2);  // DMA 1:3
#endif
}

#endif  // UART_SURRENDER_DMA1_CHAN2_3

#if STM32G0B1xx
#define USART2_IRQn USART2_LPUART2_IRQn
void USART2_LPUART2_IRQHandler() {
  on_usart_interrupt(1);
}

#define DMA1_Channel4_IRQn DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQn
#define DMA1_Channel5_IRQn DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQn

void DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQHandler() {
  on_rx_dma_interrupt(1);  // DMA 1:4
  dispatch_tx_dma(0);      // DMA 1:5
  dispatch_tx_dma(3);      // DMA 1:6
  dispatch_tx_dma(4);      // DMA 1:7

  on_rx_dma_interrupt(2);  // DMA 2:1
  on_rx_dma_interrupt(3);  // DMA 2:2
  on_rx_dma_interrupt(4);  // DMA 2:3
  on_rx_dma_interrupt(5);  // DMA 2:4
  dispatch_tx_dma(5);      // DMA 2:5
}

void USART3_4_5_6_LPUART1_IRQHandler() {
  on_usart_interrupt(2);
  on_usart_interrupt(3);
  on_usart_interrupt(4);
  on_usart_interrupt(5);
}

#else
void USART2_IRQHandler() {
  on_usart_interrupt(1);
}

#define DMA1_Channel4_IRQn DMA1_Ch4_5_DMAMUX1_OVR_IRQn
#define DMA1_Channel5_IRQn DMA1_Ch4_5_DMAMUX1_OVR_IRQn

void DMA1_Ch4_5_DMAMUX1_OVR_IRQHandler() {
  on_rx_dma_interrupt(1);  // DMA 1:4
  dispatch_tx_dma(0);      // DMA 1:5
}
#endif


static const stm32_uart_config_t stm32_uart_config[] = {
    {
      // rulos uart 0
        .instance = USART1,
        .instance_irqn = USART1_IRQn,

        .rx_pin = RULOS_UART0_RX_PIN,
#define GPIO_A10 123
#if RULOS_UART0_RX_PIN == GPIO_A10
        .rx_altfunc = GPIO_AF1_USART1,
#else
        .rx_altfunc = GPIO_AF0_USART1,
#endif
#undef GPIO_A10
        .rx_dma_instance = DMA1, // comment out to test interrupts
        .rx_dma_channel = LL_DMA_CHANNEL_1,
        .rx_dma_irqn = DMA1_Channel1_IRQn,
        .rx_dma_request = DMA_REQUEST_USART1_RX,

        .tx_pin = RULOS_UART0_TX_PIN,
#define GPIO_A9 123
#if RULOS_UART0_TX_PIN == GPIO_A9
        .tx_altfunc = GPIO_AF1_USART1,
#else
        .tx_altfunc = GPIO_AF0_USART1,
#endif
#undef GPIO_A9
        .tx_dma_chan = DMA1_Channel5,
        .tx_dma_irqn = DMA1_Channel5_IRQn,
        .tx_dma_request = DMA_REQUEST_USART1_TX,
    },
    {
      // rulos uart 1
        .instance = USART2,
        .instance_irqn = USART2_IRQn,
        .rx_pin = RULOS_UART1_RX_PIN,
        .rx_altfunc = GPIO_AF1_USART2,
        .rx_dma_instance = DMA1,
        .rx_dma_channel = LL_DMA_CHANNEL_4,
        .rx_dma_irqn = DMA1_Channel4_IRQn,
        .rx_dma_request = DMA_REQUEST_USART2_RX,

#ifndef temp_disabled_UART_SURRENDER_DMA1_CHAN2_3
        .tx_pin = RULOS_UART1_TX_PIN,
        .tx_altfunc = GPIO_AF1_USART2,
        .tx_dma_chan = DMA1_Channel2,
        .tx_dma_irqn = DMA1_Channel2_3_IRQn,
        .tx_dma_request = DMA_REQUEST_USART2_TX,
#endif
    },
#ifdef USART3
    {
      // rulos uart 2
        .instance = USART3,
        .instance_irqn = USART3_4_5_6_LPUART1_IRQn,

        .rx_pin = RULOS_UART2_RX_PIN,
        .rx_altfunc = GPIO_AF4_USART3,
        .rx_dma_instance = DMA2,
        .rx_dma_channel = LL_DMA_CHANNEL_1,
        .rx_dma_irqn = DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQn,
        .rx_dma_request = DMA_REQUEST_USART3_RX,

        .tx_pin = RULOS_UART2_TX_PIN,
        .tx_altfunc = GPIO_AF4_USART3,
#ifndef UART_SURRENDER_DMA1_CHAN2_3
        .tx_dma_chan = DMA1_Channel3,
        .tx_dma_irqn = DMA1_Channel2_3_IRQn,
        .tx_dma_request = DMA_REQUEST_USART3_TX,
#endif
    },
#endif
#ifdef USART4
    {
      // rulos uart 3
        .instance = USART4,
        .instance_irqn = USART3_4_5_6_LPUART1_IRQn,
        .rx_pin = RULOS_UART3_RX_PIN,
        .rx_altfunc = GPIO_AF4_USART4,
        .rx_dma_instance = DMA2,
        .rx_dma_channel = LL_DMA_CHANNEL_2,
        .rx_dma_irqn = DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQn,
        .rx_dma_request = DMA_REQUEST_USART4_RX,

        .tx_pin = RULOS_UART3_TX_PIN,
        .tx_altfunc = GPIO_AF4_USART4,
        .tx_dma_chan = DMA1_Channel6,
        .tx_dma_irqn = DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQn,
        .tx_dma_request = DMA_REQUEST_USART4_TX,
    },
#endif
#ifdef USART5
    {
      // rulos uart 4
        .instance = USART5,
        .instance_irqn = USART3_4_5_6_LPUART1_IRQn,

        .rx_pin = RULOS_UART4_RX_PIN,
#define GPIO_B1 123
#if RULOS_UART4_RX_PIN == GPIO_B1
        .rx_altfunc = GPIO_AF8_USART5,
#else
        .rx_altfunc = GPIO_AF3_USART5,
#endif
#undef GPIO_B1
        .rx_dma_instance = DMA2,
        .rx_dma_channel = LL_DMA_CHANNEL_3,
        .rx_dma_irqn = DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQn,
        .rx_dma_request = DMA_REQUEST_USART5_RX,

        .tx_pin = RULOS_UART4_TX_PIN,
        .rx_altfunc = GPIO_AF3_USART5,
        .tx_dma_chan = DMA1_Channel7,
        .tx_dma_irqn = DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQn,
        .tx_dma_request = DMA_REQUEST_USART5_TX,
    },
#endif
#ifdef USART6
    {
      // rulos uart 5
        .instance = USART6,
        .instance_irqn = USART3_4_5_6_LPUART1_IRQn,
        .rx_pin = RULOS_UART5_RX_PIN,
        .rx_altfunc = GPIO_AF3_USART6,
        .rx_dma_instance = DMA2,
        .rx_dma_channel = LL_DMA_CHANNEL_4,
        .rx_dma_irqn = DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQn,
        .rx_dma_request = DMA_REQUEST_USART6_RX,

