jelson/rulos/src/lib/chip/arm/stm32/periph/uart/uart.c
        .tx_pin = RULOS_UART5_TX_PIN,
        .tx_altfunc = GPIO_AF3_USART6,
        .tx_dma_chan = DMA2_Channel5,
        .tx_dma_irqn = DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQn,
        .tx_dma_request = DMA_REQUEST_USART6_TX,
    },
#endif
};

///////////// stm32g4

#elif defined(RULOS_ARM_stm32g4)

void USART1_IRQHandler() {
  on_usart_interrupt(0);
}

// DMA IRQ handlers are owned by the RULOS DMA core (core/dma.c).

static const stm32_uart_config_t stm32_uart_config[] = {
    {
        .instance = USART1,
        .instance_irqn = USART1_IRQn,

        .rx_pin = RULOS_UART0_RX_PIN,
        .rx_altfunc = GPIO_AF7_USART1,

        .tx_pin = RULOS_UART0_TX_PIN,
        .tx_altfunc = GPIO_AF7_USART1,

        .rx_dma_req = RULOS_DMA_REQ_USART1_RX,
        .tx_dma_req = RULOS_DMA_REQ_USART1_TX,
    },
};

/////////////////////////////////////////

#else
#error "Tell the UART code about your chip's UART."
#include <stophere>
#endif

// Eventually this should be conditional depending on what kind of
// chip you have
#define NUM_UARTS (sizeof(stm32_uart_config) / sizeof(stm32_uart_config[0]))
static stm32_uart_t g_stm32_uarts[NUM_UARTS] = {};

/*
 * RX DMA is used when (a) the chip family has DMA capacity for it and
 * (b) this particular UART entry in stm32_uart_config is set up with a
 * DMA request/instance. On families that use the new RULOS DMA
 * abstraction, every configured UART always uses RX DMA (there's no
 * "polled RX on a family with DMA" mixed mode), so the macro short-
 * circuits to true. On legacy families the macro inspects the struct.
 */
#if USE_RX_DMA_FOR_CHIP && USE_RULOS_DMA_FOR_UART
#define USART_USING_RX_DMA(config) (true)
#elif USE_RX_DMA_FOR_CHIP
#define USART_USING_RX_DMA(config) ((config)->rx_dma_instance != NULL)
#else
#define USART_USING_RX_DMA(config) (false)
#endif

///////////////////// reception /////////////////////////////

static void on_rx_buffer_full(uint8_t uart_id, stm32_uart_t *u,
                              const stm32_uart_config_t *c);

//// Receiving: DMA Version

#if USE_RX_DMA_FOR_CHIP && USE_RULOS_DMA_FOR_UART

/*
 * G4 (and future migrated families) drive RX DMA through the RULOS DMA
 * abstraction. The channel is allocated once at hal_uart_init time;
 * each half-buffer rx restart just reprograms the addresses and
 * restarts via rulos_dma_start.
 */
static void hal_uart_on_rx_dma_tc(void *user_data);

static void hal_uart_start_rx_dma(stm32_uart_t *u,
                                  const stm32_uart_config_t *config) {
  LL_USART_EnableDMAReq_RX(config->instance);
  rulos_dma_start(u->rx_dma_ch,
                  (volatile void *)LL_USART_DMA_GetRegAddr(
                      config->instance, LL_USART_DMA_REG_DATA_RECEIVE),
                  u->rx_curr_base_buf, u->rx_half_buflen);
}

// TC callback from the RULOS DMA core. Runs in DMA IRQ context. The
// user_data pointer encodes the RULOS uart_id.
static void hal_uart_on_rx_dma_tc(void *user_data) {
  uint8_t uart_id = (uint8_t)(uintptr_t)user_data;
  stm32_uart_t *u = &g_stm32_uarts[uart_id];
  const stm32_uart_config_t *config = &stm32_uart_config[uart_id];
  if (!u->initted) {
    return;
  }
  u->tot_ints++;
  u->tot_rx_bytes += u->rx_half_buflen;
  on_rx_buffer_full(uart_id, u, config);
}

static size_t get_rx_stored_chars_dma(uint8_t uart_id, stm32_uart_t *u,
                                      const stm32_uart_config_t *c) {
  (void)c;
  rulos_dma_stop(u->rx_dma_ch);
  const size_t free_space = rulos_dma_get_remaining(u->rx_dma_ch);
  const size_t rx_chars = u->rx_half_buflen - free_space;
  u->tot_rx_bytes += rx_chars;
  return rx_chars;
}

#elif USE_RX_DMA_FOR_CHIP  // legacy LL-direct RX DMA path (still used on G0)

static void hal_uart_start_rx_dma(stm32_uart_t *u,
                                  const stm32_uart_config_t *config) {
  LL_DMA_DisableChannel(config->rx_dma_instance, config->rx_dma_channel);

  // Enable DMA RX interrupts
  NVIC_SetPriority(config->rx_dma_irqn, 1);
  NVIC_EnableIRQ(config->rx_dma_irqn);

  LL_DMA_ClearFlag_TC(config->rx_dma_instance, config->rx_dma_channel);
  LL_DMA_ConfigTransfer(config->rx_dma_instance, config->rx_dma_channel,
                        LL_DMA_DIRECTION_PERIPH_TO_MEMORY |
                            LL_DMA_PRIORITY_MEDIUM | LL_DMA_MODE_NORMAL |
                            LL_DMA_PERIPH_NOINCREMENT |
                            LL_DMA_MEMORY_INCREMENT | LL_DMA_PDATAALIGN_BYTE |
                            LL_DMA_MDATAALIGN_BYTE);

  LL_DMA_ConfigAddresses(
      config->rx_dma_instance, config->rx_dma_channel,
      LL_USART_DMA_GetRegAddr(config->instance, LL_USART_DMA_REG_DATA_RECEIVE),
      (uint32_t)u->rx_curr_base_buf,
      LL_DMA_GetDataTransferDirection(config->rx_dma_instance,
                                      config->rx_dma_channel));
  LL_DMA_SetDataLength(config->rx_dma_instance, config->rx_dma_channel,
                       u->rx_half_buflen);
  LL_DMA_SetPeriphRequest(config->rx_dma_instance, config->rx_dma_channel,
                          config->rx_dma_request);
  LL_DMA_EnableIT_TC(config->rx_dma_instance, config->rx_dma_channel);
  LL_USART_EnableDMAReq_RX(config->instance);
  LL_DMA_EnableChannel(config->rx_dma_instance, config->rx_dma_channel);
}

// Called when a DMA interrupt arrives for a UART. Determine if it is a
// completion interrupt, and if so, send an upcall.
static void on_rx_dma_interrupt(uint8_t uart_id) {
  stm32_uart_t *u = &g_stm32_uarts[uart_id];
  const stm32_uart_config_t *config = &stm32_uart_config[uart_id];

  if (!u->initted) {
    return;
  }

  u->tot_ints++;

  if (LL_DMA_IsActiveFlag_TC(config->rx_dma_instance, config->rx_dma_channel)) {
    LL_DMA_ClearFlag_TC(config->rx_dma_instance, config->rx_dma_channel);
    u->tot_rx_bytes += u->rx_half_buflen;
    on_rx_buffer_full(uart_id, u, config);
  }
}

static size_t get_rx_stored_chars_dma(uint8_t uart_id, stm32_uart_t *u,
                                      const stm32_uart_config_t *c) {
  // Disable DMA
  LL_DMA_DisableChannel(c->rx_dma_instance, c->rx_dma_channel);

  // Determine how many bytes are left to read, and thus how many were read
  const size_t free_space =
      LL_DMA_GetDataLength(c->rx_dma_instance, c->rx_dma_channel);
  const size_t rx_chars = u->rx_half_buflen - free_space;
  u->tot_rx_bytes += rx_chars;
  return rx_chars;
}

#else  // USE_RX_DMA_FOR_CHIP

