jelson/rulos/src/lib/chip/arm/stm32/periph/uart/uart.c
  rulos_irq_state_t irq = hal_start_atomic();
  assert(!u->rx_cb_ready);
  u->rx_cb_ready = true;
  maybe_flush_rx_buf(uart_id, u, c);
  hal_end_atomic(irq);
}

/////// transmission

#if !USE_RULOS_DMA_FOR_UART
static void dispatch_tx_dma(uint8_t uart_id) {
  const stm32_uart_t *u = &g_stm32_uarts[uart_id];
  if (!u->initted) {
    return;
  }

  HAL_DMA_IRQHandler(u->hal_uart_handle.hdmatx);
}
#endif

static void maybe_launch_next_tx(stm32_uart_t *uart) {
  assert(uart->next_sendbuf_cb != NULL);
#if !USE_RULOS_DMA_FOR_UART
  assert(HAL_UART_GetState(&uart->hal_uart_handle) == HAL_UART_STATE_READY);
#endif

  // Ask the layer above for the next buffer to send by calling the "send ready"
  // callback
  const char *buf;
  uint16_t len;
  uart->next_sendbuf_cb(uart->uart_id, uart->user_data, &buf, &len);

  if (len == 0) {
    // tx train complete!
    uart->next_sendbuf_cb = NULL;
  } else {
    // Start the transfer
#if USE_RULOS_DMA_FOR_UART
    rulos_dma_start(uart->tx_dma_ch, uart->usart_tdr, (void *)buf, len);
#else
    if (HAL_UART_Transmit_DMA(&uart->hal_uart_handle, (uint8_t *)buf, len) !=
        HAL_OK) {
      __builtin_trap();
    }
#endif
    uart->tot_tx_bytes += len;
    if (len > uart->max_chars_per_tx_batch) {
      uart->max_chars_per_tx_batch = len;
    }
  }
}

#if USE_RULOS_DMA_FOR_UART
// TC callback from the RULOS DMA core. Runs in DMA IRQ context. The
// user_data pointer encodes the RULOS uart_id.
static void hal_uart_on_tx_dma_tc(void *user_data) {
  uint8_t uart_id = (uint8_t)(uintptr_t)user_data;
  stm32_uart_t *u = &g_stm32_uarts[uart_id];
  if (!u->initted) {
    return;
  }
  // Re-arm if there's more data queued upstream.
  if (u->next_sendbuf_cb != NULL) {
    maybe_launch_next_tx(u);
  }
}
#else
// Callback called when TX is complete. This overrides a weak symbol in the HAL
// implementation.
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *hal_uart_handle) {
  for (unsigned int i = 0; i < NUM_UARTS; i++) {
    if (&g_stm32_uarts[i].hal_uart_handle == hal_uart_handle) {
      maybe_launch_next_tx(&g_stm32_uarts[i]);
    }
  }
}
#endif

void hal_uart_start_send(uint8_t uart_id, hal_uart_next_sendbuf_cb cb) {
  stm32_uart_t *u = &g_stm32_uarts[uart_id];
  if (!u->tx_gpio_initted) {
    const stm32_uart_config_t *config = &stm32_uart_config[uart_id];
    config_gpio(config, false);
    u->tx_gpio_initted = true;
  }
  assert(u->next_sendbuf_cb == NULL);
  u->next_sendbuf_cb = cb;
  maybe_launch_next_tx(u);
}

///// initialization

// We configure the GPIO only on-demand, i.e. configure the rx pin on the first
// rx and the tx pin on the first tx. This makes it easy to do half-duplex,
// e.g. use the tx pin for something else if you only plan to receive on the
// uart.
static void config_gpio(const stm32_uart_config_t *config, bool rx) {
  GPIO_InitTypeDef GPIO_InitStruct;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;

  if (rx) {
    GPIO_InitStruct.Pin = config->rx_pin.pin;
#if !defined(RULOS_ARM_stm32f1)
    GPIO_InitStruct.Alternate = config->rx_altfunc;
#endif
    HAL_GPIO_Init(config->rx_pin.port, &GPIO_InitStruct);
  } else {
    GPIO_InitStruct.Pin = config->tx_pin.pin;
#if !defined(RULOS_ARM_stm32f1)
    GPIO_InitStruct.Alternate = config->tx_altfunc;
#endif
    HAL_GPIO_Init(config->tx_pin.port, &GPIO_InitStruct);
  }
}

void hal_uart_init(uint8_t uart_id, uint32_t baud,
                   void *user_data /* for both rx and tx upcalls */,
                   size_t *max_tx_len /* OUT */) {
  assert(uart_id < NUM_UARTS);
  stm32_uart_t *uart = &g_stm32_uarts[uart_id];
  const stm32_uart_config_t *config = &stm32_uart_config[uart_id];
  uart->initted = true;
  uart->uart_id = uart_id;
  uart->user_data = user_data;
  *max_tx_len = 65535;

  // Note: RULOS HAL uarts are numbered starting from 0.
  // STM32 UARTs are numbered starting from 1.

  // Enable USART clock
  switch (uart_id) {
#ifdef USART1
    case 0:
      __HAL_RCC_USART1_CLK_ENABLE();
      break;
#endif

#ifdef USART2
    case 1:
      __HAL_RCC_USART2_CLK_ENABLE();
      break;
#endif

#ifdef USART3
    case 2:
      __HAL_RCC_USART3_CLK_ENABLE();
      break;
#endif

#ifdef USART4
    case 3:
      __HAL_RCC_USART4_CLK_ENABLE();
      break;
#endif

#ifdef USART5
    case 4:
      __HAL_RCC_USART5_CLK_ENABLE();
      break;
#endif

#ifdef USART6
    case 5:
      __HAL_RCC_USART6_CLK_ENABLE();
      break;
#endif
    default:
      assert(false);
      break;
  }

#if USE_RULOS_DMA_FOR_UART
  // Configure USART via the LL layer (no HAL UART dependency on
  // migrated families).
  LL_USART_Disable(config->instance);
  LL_USART_InitTypeDef usart_init = {
      .PrescalerValue = LL_USART_PRESCALER_DIV1,
      .BaudRate = baud,
      .DataWidth = LL_USART_DATAWIDTH_8B,
      .StopBits = LL_USART_STOPBITS_1,
      .Parity = LL_USART_PARITY_NONE,
      .TransferDirection = LL_USART_DIRECTION_TX_RX,
      .HardwareFlowControl = LL_USART_HWCONTROL_NONE,
      .OverSampling = LL_USART_OVERSAMPLING_16,
  };
  if (LL_USART_Init(config->instance, &usart_init) != SUCCESS) {
    __builtin_trap();
  }
  LL_USART_Enable(config->instance);

  // Cache the TDR address so the TX DMA path can reach it without a
  // config struct lookup on every transmit.
  uart->usart_tdr = (volatile void *)LL_USART_DMA_GetRegAddr(
      config->instance, LL_USART_DMA_REG_DATA_TRANSMIT);

  // Allocate a RULOS DMA channel for TX. The core layer handles
  // channel selection, DMAMUX programming, and IRQ wiring.
  const rulos_dma_config_t tx_cfg = {
      .request = config->tx_dma_req,
      .direction = RULOS_DMA_DIR_MEM_TO_PERIPH,
      .mode = RULOS_DMA_MODE_NORMAL,
      .periph_width = RULOS_DMA_WIDTH_BYTE,
      .mem_width = RULOS_DMA_WIDTH_BYTE,
      .periph_increment = false,
      .mem_increment = true,
      .priority = RULOS_DMA_PRIORITY_LOW,
      .tc_callback = hal_uart_on_tx_dma_tc,
      .user_data = (void *)(uintptr_t)uart_id,
  };
  uart->tx_dma_ch = rulos_dma_alloc(&tx_cfg);
  if (uart->tx_dma_ch == NULL) {
    __builtin_trap();
  }

  // Allocate a RULOS DMA channel for RX.
  const rulos_dma_config_t rx_cfg = {
      .request = config->rx_dma_req,
      .direction = RULOS_DMA_DIR_PERIPH_TO_MEM,
      .mode = RULOS_DMA_MODE_NORMAL,
      .periph_width = RULOS_DMA_WIDTH_BYTE,
      .mem_width = RULOS_DMA_WIDTH_BYTE,
      .periph_increment = false,
      .mem_increment = true,
      .priority = RULOS_DMA_PRIORITY_MEDIUM,
      .tc_callback = hal_uart_on_rx_dma_tc,
      .user_data = (void *)(uintptr_t)uart_id,
  };
  uart->rx_dma_ch = rulos_dma_alloc(&rx_cfg);
  if (uart->rx_dma_ch == NULL) {
    __builtin_trap();
  }

  // Wire the UART's TX-empty signal to the DMA request line. The
  // pre-refactor code set this bit on every HAL_UART_Transmit_DMA
  // call; now we set it once at init and leave it on for the life of
  // the UART.
  LL_USART_EnableDMAReq_TX(config->instance);
#else
  // Legacy HAL UART + HAL DMA init path (F0/F1/F3/G0; migrated in
  // later phases of the DMA refactor).
  uart->hal_uart_handle.Instance = config->instance;
  uart->hal_uart_handle.Init.BaudRate = baud;
  uart->hal_uart_handle.Init.WordLength = UART_WORDLENGTH_8B;
  uart->hal_uart_handle.Init.Parity = UART_PARITY_NONE;
  uart->hal_uart_handle.Init.StopBits = UART_STOPBITS_1;
  uart->hal_uart_handle.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  uart->hal_uart_handle.Init.Mode = UART_MODE_TX_RX;
#if defined(RULOS_ARM_stm32g0)
  uart->hal_uart_handle.Init.OverSampling = UART_OVERSAMPLING_16;
  uart->hal_uart_handle.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
  uart->hal_uart_handle.Init.ClockPrescaler = UART_PRESCALER_DIV1;
  uart->hal_uart_handle.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
#endif
  if (HAL_UART_Init(&uart->hal_uart_handle) != HAL_OK) {
    __builtin_trap();
  }

  // Configure the DMA controller for TX
  uart->hal_dma_tx_handle.Instance = config->tx_dma_chan;
#if defined(RULOS_ARM_stm32g0)
  uart->hal_dma_tx_handle.Init.Request = config->tx_dma_request;
#endif
  uart->hal_dma_tx_handle.Init.Direction = DMA_MEMORY_TO_PERIPH;
  uart->hal_dma_tx_handle.Init.PeriphInc = DMA_PINC_DISABLE;
  uart->hal_dma_tx_handle.Init.MemInc = DMA_MINC_ENABLE;
  uart->hal_dma_tx_handle.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
  uart->hal_dma_tx_handle.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
  uart->hal_dma_tx_handle.Init.Mode = DMA_NORMAL;
  uart->hal_dma_tx_handle.Init.Priority = DMA_PRIORITY_LOW;
  if (HAL_DMA_Init(&uart->hal_dma_tx_handle) != HAL_OK) {
    __builtin_trap();
  }

  // Associate the initialized DMA handle to the UART handle
  __HAL_LINKDMA(&uart->hal_uart_handle, hdmatx, uart->hal_dma_tx_handle);

  // Set up DMA interrupt
  HAL_NVIC_SetPriority(config->tx_dma_irqn, 1, 0);
  HAL_NVIC_EnableIRQ(config->tx_dma_irqn);
#endif  // USE_RULOS_DMA_FOR_UART

  // Set up USART peripheral interrupt
  HAL_NVIC_SetPriority(config->instance_irqn, 1, 0);
  HAL_NVIC_EnableIRQ(config->instance_irqn);
}

void hal_uart_log_stats(uint8_t uart_id) {
  assert(uart_id < NUM_UARTS);
  stm32_uart_t *u = &g_stm32_uarts[uart_id];
  (void)u;

  LOG("stats for UART %u", uart_id);
  LOG(" total rx: %lu", u->tot_rx_bytes);
  LOG(" total tx: %lu", u->tot_tx_bytes);
  LOG(" frame_errors: %lu", u->frame_errors);
  LOG(" parity_errors: %lu", u->parity_errors);
  LOG(" noise_errors: %lu", u->noise_errors);
  LOG(" overruns: %lu", u->overruns);
  LOG(" dropped rx bytes: %lu", u->dropped_rx_bytes);
#ifdef LL_USART_ISR_RXNE_RXFNE
  const stm32_uart_config_t *config = &stm32_uart_config[uart_id];
  (void)config;
  LOG(" rx fifo: %lu", LL_USART_GetRXFIFOThreshold(config->instance));
#endif
  LOG(" min isr chars: %u", u->min_chars_per_rx_isr);
  LOG(" max isr chars: %u", u->max_chars_per_rx_isr);
}
